#주석이란?
#주석은 컴퓨터에게 전달하는 명령에서 예외처리하는 문법
#주석은 크게 줄(행)주석과 블럭주석으로 나뉜다.
#줄주석은 #뒤에 모두 주석처리된다.
#블럭주석은 """(따옴표 3개)로 시작점을 지정하고 """로 끝을 지정하면
#그 사이 모든행이 주석처리된다. 즉, 한번에 여러행을 주석처리한다.


# print("쌍다옴표 안의 내용 출력");print("이어 쓰기 실행")#주석은 이렇게 특정행을 설명하는 용도
# print("쌍다옴표 안의 내용 출력");#또는 불필요한 코드를 예외처리한다 print("이어 쓰기 실행")
# """
# print("이어쓰기");print();print(";(쎄미콜론이라고 읽는다)")
# print("이어쓰기");print();print(";(쎄미콜론이라고 읽는다)")
# print("쌍다옴표 안의 내용 출력");print("이어 쓰기 실행")
# print("쌍다옴표 안의 내용 출력");print("이어 쓰기 실행")
# print("이어쓰기");print();print(";(쎄미콜론이라고 읽는다)")"""
# print("이어쓰기");print();print(";(쎄미콜론이라고 읽는다)")
# 주석 단축키
# ctrl + / [주석을 토글(on/off)방식으로 적용]
# ctrl + k + c [주석을 누적 적용함]#(동시에 말고 순서대로 눌러야함)
# ctrl + k + u [주석을 누적 해제함]#(동시에 말고 순서대로 눌러야함)

# print("Hello python")

# print("Hello \n pyhton")

# print("재밌는");print("pyhyon")

# print("Hello"
#       "python"
#       "start")


# print("Hello\n"
#       "Python\n"
#       "Start")

# print("저의 이름은 정혜란 입니다.\n"
#     "저의 나이는 33살입니다.\n"
#     "주소는 양산입니다.")

# print("저의 이름은 정혜란입니다.")
# print("저의 나이는 33살입니다.")
# print("주소는 양산입니다.")

#행번호가 있고 ctrl+alt키를 누르고 방향기를 누르면 ..멀티셀렉트가 된다..
#윈도우 단축기 해제해야한다... 나는 모니터가 돌아가....헿




# print("12345678123456781234567812345678123456781234567812345678")
# print("Have\t" "a\t" "Good\t" "Time.");
# print("1234567\t" "1\t" "12345678\t" "123");
# print("대한민국\t만세\t만만세\t")

# print("쌍 따옴표\"")
# #따옴표는 짝을 찾아야하는데 \표시가 있으면 그것을 표현 하게 된다.
# #쌍으로 매칭해야한다.
# print("홋 따옴표'")

# print('쌍 따옴표"')

# print('홋 따옴표\'') #-> 홋 따옴표'
# #print("메롱오오오 500\\""안뇽 200\"")
# print('표현 \방식') #->표현 \방식
# print('표현 \2 방식') 
# print('표현 \\2 방식')
# #print('표현 방식\') #error code
# print('표현 방식 \\') #->표현 방식\


# print('표현 \방식')
# print('표현 \1방식')
# print('표현 \2방식')
# print('표현 \3방식')
# print('표현 \4방식')
# print('표현 \5방식')
# print('표현 \6방식')
# print('표현 \7방식')
# print('표현 \8방식')
# print('표현 \9방식')
# print('표현 \10방식')#(앞에 한칸을 지운다..?)
# print('표현 \200방식')
# print('표현 \\2방식')

# print("========================\n")
# print("\t /)/)")
# print("\t(  ..)")
# print("\t(  >♡")
# print("    Have a good Time.\n")
# print("========================\n")

# print("\n")

# print("\t""\t""###회비 정보###")
# print("=================================================")
# print("이름\t""\t""나이\t""전화번호\t""회비")
# print("=================================================")
# print("홍길동\t""\t""\"15\"\t""010-123-1234\t""\\20,000")
# print("임꺽정\t""\t""\"20\"\t""010-234-2345\t""\\30,000")
# print("김말이\t""\t""\"28\"\t""010-345-3456\t""\\50,000")
# print("-------------------------------------------------")
# print("총합계\t""\t""\t""\t""\t""\\100,000")
# print("=================================================")

# print("\t""\t""###회비 정보###")
# print("=================================================")
# print("이름\t""\t""나이\t""전화번호\t""회비")
# print("=================================================")
# print("홍길동\t""\t"'"15"'"\t""010-123-1234\t""\\20,000")
# print("임꺽정\t""\t" "\"20\" \t""010-234-2345\t""\\30,000")
# print("김말이\t""\t""\"28\"\t""010-345-3456\t""\\50,000")
# print("-------------------------------------------------")
# print("총합계\t""\t""\t""\t""\t""\\100,000")
# print("=================================================")
