#  인증 프로그램을 만드시오. 
#  1.아이디가 틀리면 등록되지 않은 아이디 입니다 출력 
#  2.비밀번호가 틀리면 비밀번호가 틀렸습니다 출력 
#  3.아이디와 비밀번호가 일치한다면 인증 통과 출력
# 중첩으로 만들고, 하나는 네이버처럼 (아이디 패스워드 한번에 입력)
# 구글은 (아이디 인증 후 패스워드 입력)
#===> 20일 수업

# 이름, 학번, 3과목의 성적을 입력 받아 합계와 평균을 구하고, 
# 평균이 90이상이면 ‘A’, 80 이상‘B’, 70이상 ’C’, 
# 60이상 ‘D’, 60미만이면 ‘F’ 를 출력하시오 


# 커피의 개당 가격은 2000원이다. 
# 10개 초과하면 초과하는 양에 대해서만 개당 1500원씩 받는다. 
# 커피의 개수를 입력 받아 금액을 출력하시오

# 정수를 입력받아 아래와 같이 출력하시오. 
# 3의배수이면서,4의배수 입니다 
# 3의배수 입니다 
# 4의배수 입니다 
# 3의배수도,4의배수도 아닙니다 
# 0은3의 배수도 4의 배수도 아닙니다. 

# 비행기를 타는데 30분 거리까지의 기본 요금은 30000원이며, 
# 10분 단위로 추가요금 5000원씩 부가된다. 
# 비행기 탈 시간을 입력하여 요금 계산기를 만드시오.

#===> 20일 수업(다중 if문)

# 첫날에 10원을 예금하고, 다음날에는 전날의 
# 2배를 예금하는 방식으로 한 달(30일) 동안 저축한 금액중 
# 마지막 저금액과 총 저금 금액을 구하시오. 

#===> 21일 수업


# 다음 문자열 중에서 ‘a’의 개수와 ‘s’의 개수 그리고 총 개수(공백 포함)도 구하시오 
# 결과 
# 총 개수 : 24 
# a 개수 : 2 
# s 개수 : 3
# sum_=1
# st = "It is a fun Python class" 

#===> 22일 수업

# 2중 for 문을 이용하여 아래와 같이 출력 하시오 
# 1       2       3       4       5
# 6       7       8       9       10
# 11      12      13      14      15
# 16      17      18      19      20
# 21      22      23      24      25
#->여러 방법을 만들어보자아아

#+===> 23일 수업

# 문제 (미니 프로젝트로 진행 될 예정)
# 자판기!! 교안 참고

# ❖ 쌀 100통이 저장되어 있는 창고에 암수 1쌍의 쥐가 있다. 
# 쥐 한 마리가 하루에 20g씩의 쌀을 먹고, 10일(10,20,30)마다 
# 쥐의 수가 2배씩 증가한다. 
# 며칠 만에 창고의 쌀이 모두 쥐의 먹이가 될까. 
# 그리고 쥐는 총 몇 마리 인가? 
# (쌀 한 통 =  1kg)(쌀을 먹은 후 2배 증가하는 조건)
# --->>쌀을 먹은 후 2배 증가하는 조건 : 순서를 잘 생각해봐야한다.
# -->결과도 보내라!
#==> 24일 수업

# # 이중 포문을 와일 문으로 변환하는뎅..이중 와일문으로 변환
# for i in range ( 0 , 3 , 1): 
#     for k in range ( 0 , 5 , 1): 
#         if k == 3: 
#             break 
#         print("(i : %d\tk : %d)" % (i , k )) 
# ==> 24일 풀이